tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1825_tdd.h
#define CCP2AS2                       522
#define CCP2ASE                       523
#define PSTR2CON                      524
#define STR2A                         525
#define STR2B                         526
#define STR2C                         527
#define STR2D                         528
#define STR2SYNC                      529
#define CCPTMRS                       530
#define C1TSEL0                       531
#define C1TSEL                        532
#define C1TSEL1                       533
#define C2TSEL0                       534
#define C2TSEL                        535
#define C2TSEL1                       536
#define C3TSEL0                       537
#define C3TSEL                        538
#define C3TSEL1                       539
#define C4TSEL                        540
#define C4TSEL0                       541
#define C4TSEL1                       542
#define CCPR3L                        543
#define CCPR3H                        544
#define CCP3CON                       545
#define CCP3M                         546
#define CCP3M0                        547
#define CCP3M1                        548
#define CCP3M2                        549
#define CCP3M3                        550
#define DC3B                          551
#define DC3B0                         552
#define DC3B1                         553
#define CCPR4L                        554
#define CCPR4H                        555
#define CCP4CON                       556
#define CCP4M                         557
#define CCP4M0                        558
#define CCP4M1                        559
#define CCP4M2                        560
#define CCP4M3                        561
#define DC4B0                         562
#define DC4B                          563
#define DC4B1                         564
#define INLVLA                        565
#define INLVLA0                       566
#define INLVLA1                       567
#define INLVLA2                       568
#define INLVLA3                       569
#define INLVLA4                       570
#define INLVLA5                       571
#define INLVLC                        572
#define INLVLC0                       573
#define INLVLC1                       574
#define INLVLC2                       575
#define INLVLC3                       576
#define INLVLC4                       577
#define INLVLC5                       578
#define IOCAP                         579
#define IOCAP0                        580
#define IOCAP1                        581
#define IOCAP2                        582
#define IOCAP3                        583
#define IOCAP4                        584
#define IOCAP5                        585
#define IOCAN0                        586
#define IOCAN                         587
#define IOCAN1                        588
#define IOCAN2                        589
#define IOCAN3                        590
#define IOCAN4                        591
#define IOCAN5                        592
#define IOCAF0                        593
#define IOCAF                         594
#define IOCAF1                        595
#define IOCAF2                        596
#define IOCAF3                        597
#define IOCAF4                        598
#define IOCAF5                        599
#define CLKRCON                       600
#define CLKRDIV                       601
#define CLKRDIV0                      602
#define CLKRDIV1                      603
#define CLKRDIV2                      604
#define CLKRDC                        605
#define CLKRDC0                       606
#define CLKRDC1                       607
#define CLKRSLR                       608
#define CLKROE                        609
#define CLKREN                        610
#define MDCON                         611
#define MDBIT                         612
#define MDOUT                         613
#define MDOPOL                        614
#define MDSLR                         615
#define MDOE                          616
#define MDEN                          617
#define MDSRC                         618
#define MDMS0                         619
#define MDMS                          620
#define MDMS1                         621
#define MDMS2                         622
#define MDMS3                         623
#define MDMSODIS                      624
#define MDCARL                        625
#define MDCL0                         626
#define MDCL                          627
#define MDCL1                         628
#define MDCL2                         629
#define MDCL3                         630
#define MDCLSYNC                      631
#define MDCLPOL                       632
#define MDCLODIS                      633
#define MDCARH                        634
#define MDCH                          635
#define MDCH0                         636
#define MDCH1                         637
#define MDCH2                         638
#define MDCH3                         639
#define MDCHSYNC                      640
#define MDCHPOL                       641
#define MDCHODIS                      642
#define TMR4                          643
#define PR4                           644
#define T4CON                         645
#define T4CKPS0                       646
#define T4CKPS                        647
#define T4CKPS1                       648
#define TMR4ON                        649
#define T4OUTPS                       650
#define T4OUTPS0                      651
#define T4OUTPS1                      652
#define T4OUTPS2                      653
#define T4OUTPS3                      654
#define TMR6                          655
#define PR6                           656
#define T6CON                         657
#define T6CKPS0                       658
#define T6CKPS                        659
#define T6CKPS1                       660
#define TMR6ON                        661
#define T6OUTPS0                      662
#define T6OUTPS                       663
#define T6OUTPS1                      664
#define T6OUTPS2                      665
#define T6OUTPS3                      666
#define STATUS_SHAD                   667
#define C_SHAD                        668
#define DC_SHAD                       669
#define Z_SHAD                        670
#define WREG_SHAD                     671
#define BSR_SHAD                      672
#define PCLATH_SHAD                   673
#define FSR0L_SHAD                    674
#define FSR0H_SHAD                    675
#define FSR1L_SHAD                    676
#define FSR1H_SHAD                    677
#define STKPTR                        678
#define TOSL                          679
#define TOSH                          680

#endif // _PIC16F1825_H_
